// String — представляет строку.
// Number — представляет числовое значение.
// BigInt — предназначен для представления очень больших целых чисел.
// Boolean — представляет логическое значение true или false.
// Undefined — представляет одно специальное значение — undefined и указывает, что значение не установлено.
// Null — представляет одно специальное значение — null и указывает на отсутствие значения.
// Symbol — представляет уникальное значение, которое часто применяется для обращения к свойствам сложных объектов.
// Object — представляет комплексный объект.

//Псевдоложь и псевдоистина
// Falsy (ложные) значения
// В JavaScript считаются ложными (falsy):
//
//  1. false: Булевое значение false.
//  2. 0: Число ноль.
//  3. -0: Отрицательный ноль.
//  4. 0n: Число 0 типа BigInt.
//  5. "": Пустая строка.
//  6. null: Значение null.
//  7. undefined: Значение undefined.
//  8. NaN: Значение NaN (Not-a-Number).

//остальное псевдоистина


